{"comments": ["\"Steve Jobs Passed Away\", 4,271 points  -> https://news.ycombinator.com/item?id=3078128If you're interested in exploring, play around with the URL parameters for the API.  Here's the one which gets you the right answer to this specific question with the minimum amount of work:http://api.thriftdb.com/api.hnsearch.com/items/_search?q=&so...", "At a high level of abstraction: If one runs a nuclear power plant, one does not make a practice of tolerating small oil spills.  Small oil spills are almost harmless.  So are small quantities of sparks.  The combination of small oil spills and small quantities of sparks, however, is a severe problem and gets worse in a hurry if it compounds with certain other usually benign properties of nuclear power plants.Unfortunately, the sort of nuclear power plant operators which tolerate oil spills are often sufficiently not on their A game to tolerate sparks.This is a very handwavy explanation.  In particular, God doesn't hate nuclear powerplants and try to introduce sparks into them at inopportune moments just to see if they happen to find an oil spill, but The Adversary often can and will do this to your cryptosystem.", "At the risk of unsolicited dating advice: is the reason one is embarassed to mention one's occupation to a woman at the bar caused by tech salaries being too high, or by years of social conditioning telling you that geeks are low status?  (Or by learning that the way one signals high status is by constructing a low status outgroup and then explaining how you're unlike them?)An alternative: just pretend society really likes rich people who make things, and start talking about something more interesting than your work.", "Being blamed for things they self-evidently do not control? Eye rolls?  These are classic markers of low status.", "The last time a young lady asked me what I did for a living I did the Old Spice guy impersonation and mentioned I was getting flown abroad to do it for an audience.  She married me, so I now have the luxury of not caring anymore what people think of my answers, but they're generally some flavor of \"I run a company which does X\", where X is one thing I think they'll find interesting.  Possible Xes include \"helped teach  Y00,000 kids to read last year\", \"gets patients in to see their doctors\", or \"makes shedloads of money for software companies like Y\" if they look like they swing that way.You'll note the pointed absence of \"I am a poor peon working in the Ruby on Rails salt mines.\"  (And heck, even when I was a Japanese salaryman, I got better results with \"I am in charge of administration of X university's admissions exam\" rather than \"I write unit tests and XML files, please tune out of this conversation.\")", "Can you describe that in terms of an important system, somewhere, which would not exist but for your contributions?  If so, more on that story, less on the technical detail.  If on the other hand none of your work ever gets used in anything important, then that's a non-BSy reason to change what you're working on.  (Believe me -- been there, done that.)", "Do you routinely exercise purchasing authority on $20k consulting engagements? If you do, your preferences are anecdotal evidence of the business practices of one client firm. If you don't...", "It is not the universal expectation of clients that they be able to reach consultants on the telephone if they have $20k invested in that relationship.n.b. For many consultancies that is near or below the effective floor number to get them in the door, rather than being a huge anchor account.", "I regret that I cannot answer this question in the way you have phrased it, because you can't just check a box and say that a cloud host is suddenly HIPAA compliant or not.  There are various procedural safeguards which you'll need, the absence of which will make any technical safeguards irrelevant from a compliance perspective.  For example, one of the requirements is that you have a nominated HIPAA officer, another is that you have a written policy to discipline employees who abuse patient health information.  You need both of these things regardless of whether your host makes certain aspects of compliance with the Security Rule easier.About those things: HIPAA was apparently drafted by Congressional aides, not by technologists, so the Security Rule establishes a bunch of checkboxes which have eff all relevance to my main concerns as a systems engineer about application security.For example, HIPAA and the assorted guidance is, as far as I know, totally silent on what this:Do you have procedures for creating, changing, and safeguarding passwords?actually means when the bcrypt hits the road.  I'm pretty sure that \"Yes, we do.  We enforce 8 character maximum passwords, they have to be changed every 3 weeks and 1 day except when the anniversary date falls on a Tuesday, and they are secured in our database by ROT13, an advanced encryption technology.\" is facially compliant as long as you have written it down somewhere.  There is very little in terms of either best practices or safe harbors.This is a long way to say that you probably can't take an application and HIPAA-ify it by writing a check to a hosting provider.Given that you have the procedural and technical safeguards in place, I'm personally of the opinion (and feel free to check with your lawyer) that the right words, procedures, and application-level security features make it possible to host HIPAA-compliant applications on most common cloud providers.I am not a lawyer, this is not legal advice, yadda yadda.", "We are now approaching the territory of \"Seemingly simple questions it is maddeningly difficult to get a straight answer on\", but I have discussed this with multiple lawyers, often experts at HIPAA under the employ of enterprise clients, and \"You don't own the hardware?\" has never been a dealbreaker for them.YMMV.  Ask a lawyer if you want to sleep better at night.I will close with the observation that, empirically, the system that you and I come up with is OMGWTFROFLSTOMP more secure than what passes for state-of-the-art at many of our clients.  (\"We didn't want the data to be stored in a database, because that isn't secure, so just think of worse places to put data because I think I've heard them all.\")", "HN has a few subtle features to deter flame wars.  One of them is that, as a thread grows in depth, there's an automatic delay imposed on commenting in greater depth on it.  People with decisionmaking power on the HN code base believe this acts as a natural quench for stupidity neutrons, hoping to deprive the conversation of the critical mass of stupid that it needs to sustain itself.", "It was marketed as behavioral therapy, to help people get over psychological aversions to e.g. eye contact.  This may or may not have been a smokescreen over other reasons why people would purchase that video.  (Source: it was covered in general Japanese media some years ago.)", "I don't know if what your threat model is here, but if you believe the NSA can suborn any CA trusted by your user's browser, then the question of which CA you use is moot.  (Modulo something like certificate pinning, which helps if your advertising company that runs an enormous popular mail service also happens to also develop a popular browser.)Assuming that an adversary can get one suborned CA to sign a certificate for your domain, the adversary can use that certificate to MITM first connections to your site without causing any sort of warning message within the browser.  They can then both sniff and alter messages going in either direction, including e.g. stealing credentials, cookies, and what have you.", "I know a few people in my generation who \"opted out\" of The Offer (+) who eventually found themselves doing web freelancing.  There are social difficulties involved in doing it, but they're successful and MUCH happier with it than they were in their brief forays to salarymandom.We'll be getting together for our college club annual reunion in September and once more trying to tell kids \"Hey guys, if the salaryman thing doesn't pan out, we'll take you out to coffee and tell you about some other options.\"  Many middle class Japanese kids have literally never heard that once in their entire lives.+ Roughly 30% of Japanese society, mostly middle class and male, has this life plan in place from birth: You will study extraordinarily hard and test into a good high school.  You will then study extraordinarily hard and test into a good university.  You will be hired by a large Japanese megacorp along with 200 people from your university.  You will then be a salaryman, owned body and soul by your company, and worked in conditions which resemble indentured servitude for roughly your first 20 to 25 years.  In return, you will be promoted in lockstep with the rest of your entering class, you will never be fired, and you will be awarded social status and security with the guarantee of neither of them ever being imperiled by virtually anything.", "Anecdotally, the phenomenon is exacerbated by many people with varying degrees of untreated depression.  (A disease which Japan addresses shockingly poorly, even by the standards of Japanese mental health care, which is shockingly poor even considering that mental health care lags treatment of other illnesses virtually everywhere.)", "Many people are skeptical of Bitcoin loans since the expected rate of return of holding BTC exceeds the rate of return of almost all legitimate businesses.To steal a tptacek line, \"I hope to make the starburst of points which follow by implication rather than by explicit statement.\"", "Find one person who needs this like they need oxygen.  Ask them to tell their friends.  Bonus points if they have a higher than average profile / fan base / etc at the moment.  Repeat.If you cannot find one person who needs this like they need oxygen, it is highly likely that it is (regrettably) not the case that many people would enjoy this if they just knew about it.  This suggests a simple and effective criteria for building products in the future, because you don't need to have the website actually coded to extract signal on \"Do you need this like you need oxygen?\" from people.(Instagram/Vine pass this test in spades: while you could pick many, many potential use-cases, \"Hey 14 year old popular girl, would you like to get constant public positive feedback from weakly attached friends?\")", "It is absolutely possible to pick up enough programming skill on the side to be dangerous.  It makes you substantially more valuable at virtually whatever you do, assuming you're in some sort of knowledge work.  A reasonably smart person can go from knowing nothing to knowing enough to build things people will pay for in probably under a year.Traditional education is valuable for programming but is neither necessary nor sufficient for doing it commercially.This is very untrue of playing video games, by the way.  Trust the voice of experience: if you have enough time to run a WoW guild, you have enough time to build a business.  Less dragons, better loot.  I'm assuming the same is likely true with Halo.", "I wasn't born into the connections, and that's what being \"fundable\" is actually aboutAre you amenable to being convinced that this belief is false if I can point to people who had no connections at birth but are funded or clearly fundable?", "I have to agree, since I find it mind boggling that one-man construction firms are making millions.That's not that uncommon for a general contractor: you do project management and client relations, sub-contractors hire the people who string wires and swing hammers.", "There are wide swathes of the video game community which are absolutely toxic, in every possible way you can imagine and some which people of good will would have difficulty imagining.  I wish game companies did a better job of market-based approaches to limiting this.I've often thought, in League of Legends, that I'd pay $100 for access to a special queue which matched me up with other people who had paid $100 to access it.  If you earn an account ban, you can probably find a new credit card, level up again, and pay $100, but it should cut down on casual sociopathy. (Yes, that's classist as heck, but after a bad day of LoL I'm pretty OK with that as long as it means that I can play a relaxing game with people who are capable of meeting the absolute minimal norms of civilized society.)", "Professional translators often do \"shadowing\", which is listening to source material from the language you're weaker at and attempting to just transcribe it in real time.  You can start with source material which is easy, such as dialog on TV shows, and move to source material which is hard, such as news broadcasts.  (Newscasters speak much much quicker than characters in fiction and employ large and often unpredictable vocabularies, whereas most popular culture is dominated by the ~200 words at the head of the zipf distribution for that language.)It's totally free and, when you're at intermediate proficiency, both stupendously effective and the most maddening exercise you'll ever do.  (What happens when you're thrown off the deep end into a newscast about nuclear power plant issues and you're deeply out of your depth with regards to the required vocabulary?  You try your best, jot down the five words every 3 sentences you actually catch, and then break out a dictionary later to figure out why houshasen and shiyouzuminenryoupuuru seem to be so key to the topic.)(\"Radiation\" and \"pool (for storage of) used (nuclear) fuel\", respectively.  And there, now you understand 5% more of that conversation.)", "You might be confusing this with \"Productizing Twilio Applications\", which was about the engineering challenges of moving from Twilio code samples to reliable ways to test, architecture, and deploy Twilio applications.  This is rather unlike the current email, which was written today and is (to the extent I'm capable of talking about new things after eight years of writing a metric effton about this industry) all new, and focused on how to get consulting companies to turn their buy-our-time-in-discrete-chunks model into a productized buy-our-value-without-necessarily-our-time model.", "Long story short: I thought I had two types of backups, MySQL dumps and snapshots of the VPS the MySQL server ran on.  It turned out that those were both stored on the same hardware.  (D'oh.)  Which then had problems.  (D'oh.)  And my only accessible backups were a day old.  I was either forced with \"Lose a day of data\" or \"Reconstruct current state of SQL database from a machine will now not boot.\"Long story short: After some don't-try-this-at-home-kids craziness I was able to bring up a second copy of the production environment from the bare metal, initialized it with an empty database, and then copied out the contents of MySQL from the barely functioning hard drive on a machine booted into rescue mode.How did it almost lose me $X00,000?  Well, clearly losing the database is Very Bad and losing the last day of data is Quite Bad, right?  $X00,000 = somewhere between Very Bad and  Quite Bad times the value of being the sole shareholder in Appointment Reminder.", "Feel free to ask questions if you have any.Sidenote: This is the automatically archived version of an email which goes out to ~7,000 people who explicitly asked to get email from me.  I'm trying my level best to step up the frequencies of email to my list to \"every Friday\" from the more typical \"monthly.\"  I intentionally do not post things to my blog that frequently, partially because I know that I have a bit of a rep here and 95% of what I write gets to the front page.  If you guys submit everything I email to HN, that's going to wear out my welcome here in short order.  I'd have to do something drastic like having the archive page check referrers and, if its from news.ycombinator.com, spit out Markov-chain generated drivel about how Snowden hacked the Occupy the recording industry.  I don't want to do that, so please, exercise some discretion on submitting the emails.  Thanks in advance.", "1)  Has this ever actually happened to you?  If not, like most fear of success, it's probably manageable to put it off until it actually happens.2)  Clients are buying your availability, they aren't buying bump-what-you're-doing-now.  (That's a separate service, and ridiculously expensive.)  If they find makework for you on the 29th, you tell them \"Gotcha, I'll tell you when it is done and we'll count it against this month's allocation.\"  If they balk at that, you can tell them that happily your email address works all 30 days of the month and that they can get in their requests quicker for faster turn-around.Of course, the ultimate protection against clients being impossible to work with is not working with them, but -- again -- I'd wait until you actually had a problem before rejecting them for that.", "Work on increasing perceived professionalism: no lawyer in the history of the legal profession ever had this problem.  (Slight exaggeration, but not much of one.)  This is a broad topic, but in general, be more communicative, comport your affairs like you're a serious business (contracts, professional language, business mien) rather than a kid cutting lawns for beer money, etc.As a stopgap, offer to invoice after the month, not before: \"That way if I'm not there when you need me, you don't have to pay.\"", "1387 days ago Matt Asked HN for help on his elevator pitch.https://news.ycombinator.com/item?id=814685Since then, they got told \"No\" by several hundred people, switched business models, landed President Freaking Obama as an anchor client, and have created more actual value than a thousand mobifotosocialgames without ever once being in TechCrunch.  And things are starting to work for them, in a serious way.Drinks are on me when they IPO.  (Which, disclosure, if they IPO I will probably be able to afford, since I invested in an earlier round.)", "YMMV, but the best solution I've found for this is either:1)  If your CMS just needs to be used in-house, then roll your own.  It takes a week or less, you can deep-integrate it into your applications, and you'll be guaranteed to get more or less exactly what you want.2)  If you either need it to be exposed to external/non-technical people or you absolutely do not want to spend time developing CMS features, use WordPress for content pages and your app stack of choice for app pages.  You can have them share the same domain if a requirement for e.g. SEO by using reverse proxy tricks -- trivial to Google if you know the words \"reverse proxy.\"  If not a requirement, don't do it that way.One of the nice parts about using WordPress is if you have a high-generalizability problem like \"It needs to work on an iPhone\" then you are basically guaranteed that some 17 year old designer has hacked together a plugin which makes it mostly work on your iPhone.  The downside of using WordPress is that... feel free to rephrase the last sentence.", "Bingo Card Creator is 95% #1, Appointment Reminder is #2.  Client sites depend on what I can convince them to work with, largely tending to follow whomever \"owns\" the marketing site internally (engineers prefer #1, non-technical folks prefer #2).", "\"Surrender to $FEDERAL_AGENCY the sum of 100,000 bitcoins or go to jail.\"\"No.  You can't make me.\"\"Wow, that's certainly a retort which our legal system does not deal with several hundred thousand times a year.\"", "In approximately the same way they'd know how much money, dope, or shares of Toyota you have: by asking other people you did business with, counting it, convincing you to accept it from them, or otherwise bringing the routine practice of law enforcement to bear against you.", "They're undepriced, but I think the first problem is going to be going from 0 users to 10 users (bang down doors) rather than extracting the maximum proper value from those first ten users.  The optimal pricing strategy will still lead to him having 0 customers until he figures out who needs this and how to reach them repeatedly.", "So, it sucks, but it happens, and it won't matter nearly as much in June 2014 as it seems to right now.Your co-founder will, hopefully, not find out about this through guessing \"Is this my company?\" on Twitter, but rather in hearing it from you.  You may be heartbroken about it, you may cry a bit (totally OK).  Then, you will put on your Responsible Adult pants, call your employee into the office, and tell them the situation.  You will emphasize that it is in no way their fault.  You will tell them the status of your future payments to them (you can make them -- good), and instruct them that they have no job now other than lining up their next gig, and that you are totally at their disposal for making that happen.  First among all things you take care of your employees -- they have the worst risk situation of anyone involved.You will then tell your investors that you're failing and will be proceeding to wind up the business in an orderly fashion.  They probably already know this.  None of the ones who you care about will hold it against you -- \"this is the nature of the business we have chosen.\"  Some of them may likely attempt to invest in your endeavors in the future, if you decide to go down that route.You will then draw up and execute on a plan to wind down the business in an orderly fashion.  Give your customers a window on their apps going dark, if appropriate.  Turn off new signups now.  Turn off ability to take money now, unless it is absolutely required to continue paying your employees.  There likely a small mountain of very boring administrative work here -- your lawyer and accountant can help you through it.After this is over, you'll probably be very stressed.  That is fine and natural.  You're in the hottest market ever in terms of hiring right now.  If you want a job immediately, you will have many offers for it.  \"Built a company with real revenues from nothing.  Got into an accelerator.  Took funding.  It didn't work.\"  is enough of a resume to get you an interview at any number of places.  If you need introductions, you are probably well-networked enough to get them, but if for some reason you want more drop me an email.  Your designer co-founder will have, similarly, no shortage of offers.Like tptacek says below, this will not meaningfully hurt your chances of creating a business later.  You've likely learned plenty through the experience.It sucks.  It will be better, very soon.  You don't have to be scared: this is routine and, while it doesn't feel like it, you're actually in very good position, both absolutely and relative to many other people.", "It's more clear if you read his follow-up to the post.  (http://www.peteradkison.com/blog-entry-3-wizards-of-the-coas...  <-- highly recommended)What probably happened is that they (on the basis of really, really, REALLY bad advice) started with something like 1,000 shares of the company, valued at $0.50 apiece.  They did genuinely own 100% at that time.  Then as they raised the 300k they issued additional shares, at valuations between $0.50 and $4, diluting the founders horribly, because the founders did not award themselves new shares.The fundamental problem here is grossly misvaluing the company (i.e. the total value of 100% of the shares) at the time new shares were issued.  For example, if you had hypothetically bought them a drafting table for $100 (an example used later), you ended up with a 0.5% stake in the company (implicitly valuing the company at $2k at that point).  A tech company which only exists as a napkin held between two hungry young men with no asset other than a gleam in their eye gets a notional value of $250k+ on day one.  If you attempt to invest in them later, after they have e.g. a product with customers for it, the value gets re-pegged SHARPLY north of that, perhaps in the single digit millions or higher if they're doing really well.He mentions that a lot of the money men involved were annoyed by hordes of small investors making seemingly outsized returns on their initial investments.  I don't think he quiiiiite understands that they're not wrong: their outsized returns were essentially large gifts of surplus value from the founders to them.  (The money men, of course, seem a little put out that the founders didn't instead make a large gift of surplus value to them.)", "I would certainly not suggest giving away those 100 common shares for picodollars because that would compromise your business results and make it affirmatively more difficult for sophisticated investors to join you, leaving your company to only receive investment from worse investors.By the way, I signed up for Tarsnap and am using it \"in anger\" for Appointment Reminder.  My predicted bill for this month is something on the order of 60 cents.  It is, literally, the smallest business oriented bill I have ever forced my accountant to look at, and would fall below the noise floor but for the fact that I want paper records of me having paid for a professional backup service in case I ever have to prove this for my insurance agency.  (I have professional liability insurance and data loss/data breach insurance for Appointment Reminder, chiefly because I have hospitals as clients and they want to know that if I screw up there will be deep pockets in the neighborhood to sue to settle up with.  The insurance company is basically renting their deep pockets out on a \"We are willing to bet that you won't screw up\" basis, but to protect their interests, they have a 15 point checklist for various things Serious Businesses do regarding data security and if it turns out that I'm not a Serious Business than my Serious Business Insurance Policy will not actually cover me.)I would, and this is my honest and true opinion as a customer rather than as someone who has nagged you for years to raise your prices, prefer to pay $100 per month for no reason other than to avoid having my insurance company think that I am a stupid kid playing at being a real business by entrusting core parts of my infrastructure to a service which costs me sub-coffee money.  In the event of me having an insured loss (which, n.b., I hope to never have and to just set fire to the $10 a day I pay for insurance), I really don't want to have that conversation.  Please make me not have to have that conversation.  I can pay.", "There's a market between sellers of equity in early stage companies and buyers of equity in early stage companies, and sellers in that market largely will not transact with you below $250k, because they'll have better offers for their scarce product.  (This assumes, naturally, that the founders appear to have a credible chance of bringing a technology product to market.)", "You don't get $250k in exchange for the napkin.  You'll be able to possibly convince someone to pay $25k for ~9% of the napkin, contingent on you devoting the next months/years of your life to exploring napkin-like directions until it either burns or blossoms.  (If you already have a product with revenue/traction, there's plenty of reasons to counsel AGAINST taking the money at those terms, by the way.  Or any terms, for that matter.)", "This is one of the reasons why I like HN, because nothing in my lower-to-middle-class upbringing prepared me for the notion of stock as anything other than shares of IBM which you held at the brokerage until you needed to retire.  Pretty much everything I learned about the mechanics of tech investing I learned as a direct consequence of this site, in many cases to material effect.One would hope that investors, on dealing with unsophisticated entrepreneurs, would tell them \"Hey, it seems like you don't know the ropes of this yet, let me explain it to you\" but the overwhelming number of anecdotes where I hear that have that sentence followed by advice so bad it shocks the conscience.", "The first paragraph would be improved by the economic reality that dare not speak its name: adjunct.  Most people who pursue the PhD in English will fail to join the one profession which actually needs English PhDs (training future English PhDs) and instead, if they want to continue putting to use the last 7+ years of their life dedicated to mastering the reification of privilege and construction of the other as demonstrated by 18th century American advertising, end up as later-day itinerant minstrels.  The career has little to recommend it by the standards of Harvard undergrads: poor material conditions ($3,000 for teaching a course, typically no benefits), little impact, no stability, and (perhaps most cutting of all) the social slight of being a second class citizen in academia and constantly forced, in ways large and small, to acknowledge that fact.English PhDs should come with a disclaimer: \"90% of you will be unemployable.  Your professor who says that you are special and such a good writer that you deserve to give this a go is lying to you.  You are not a particularly good writer.  You have just internalized the art of flattering English PhDs, which is unfortunate, because they expect to get that done for free and have more than enough takers.  Many people who are as talented as you are unemployed or underemployed, and their only opportunity to appreciate Foucault and Kafka is when they're applying for welfare benefits.\"English undergrad is almost worse.  Even by the standards of the humanities, which chiefly exist to certify that certain students managed to be mostly literate by senior year of high school, it tries to beat any love of the language out of you.  By twist of fate and changing departmental policy, my sister (3 years my junior and a genuinely talented writer) and I ended up in the same \"freshman\" composition class.  I phoned it in and got As and A+s, she slaved away on every essay and squeaked out a B-.  She hadn't learned the bemused sneer yet.  (\"The author believes that the poor would better themselves through honest labor.  One imagines an elf in Santa's workshop, quite appropriate since the benevolent employer is a myth but the unwavering sweatshop labor in the service of fulfilling the bourgeoises' consumerist desires is very real.\"  <-- \"OMG so nails it!!\") After you've mastered the pseudointellectual bemused sneer, English class is your oyster.  My sister refused to be cynical, grappled with the texts and worked out some genuinely beautiful prose, and barely passed.  She figured it out in later years, graduated, and is currently deeply in debt after receiving a master's in an unrelated field after finding out, unsurprisingly, that a major in English makes you virtually unemployable.  (One of many deep cuts along the way: she ended up working for our alma mater in a position which was, frankly, secretarial work, and was told, when she attempted to move into a permanent position, that secretaries at our alma mater should have graduate degrees because it would reflect poorly on the institution if they had just graduated in English.)", "I have the utmost respect for literary traditions, education as a means of self-improvement, and the intangible values of persuing mastery over a broad field of human experience.And if English degrees had anything to do with that, I'd probably like them, too.  That ship has sailed and then was burnt on distant shores, long before I was born.(I don't think there's a whole lot of daylight between the two of us, honestly.)", "No, in fact I think this would be a terrible idea, because if  I put 6/21/2007 people would perceived it to be sharply less valuable without changing a single word of the article or a fact about reality as it exists in 2013.  Dating it is just asking people to discount my advice after a 48 hour window from publication.", "Thanks for that recommendation.  I'm going to sit down with that paper and have time to digest it in detail, since it seems like likely the most relevant-to-my-interests link I've seen on HN this month.", "Thanks, that is one of the best compliments I've ever gotten for my writing.  (Since I tend to write 4,000 words at a time, my biggest worry is always that I'm fluffing up one good idea into excessive length.  I aspire to always covering something in enough meaty depth to justify the length, not to have the length pre-fixed and need to pad to hit my quota.)", "For most software companies, the overwhelmingly highest expense is going to be employee salaries and direct costs of employment.  At many companies that is 80% of all expenses.  (Exceptions: companies with large advertising costs, and platform companies with exceptionally large costs that scale with the success of the core business, like you might imagine Twilio, Heroku, or Stripe having.)Consider a 3 man company which raises $5 million in investment and expands to 10.  They'll chew through a million every six months just in payroll costs.Ten is a fairly small company.  There are many VC-backed companies which are in the 100~200 employees range.  Payroll scales pretty much linearly, so...", "Clients also have a tendency to reach deeper into their pockets when the risk of failure is lowerYep.  Basically, it's an expected value calculation: your project actually costs the sticker price divided by chance of success.  (If you quote $20k and the customer's experience is that 20% of projects fail the \"true cost\" is $25k after they self-insure for risk of project failure.)Decreasing their estimate of project risk thus lets you justify higher rates.  Also, as your client has lower perception of project risk and execution risk, their perception of the probable magnitude of the success for your engagement will likely increase.  (The logic of that goes something like \"He's clearly a pro at this, as demonstrated by his execution ability, therefore if this were not likely to be a major win he'd already know that and we wouldn't be having this conversation.\")", "Your friendly neighborhood patent attorney will likely give you better advice on this question than Hacker News will.  In particular, you should probably be most concerned with whether this does, indeed, cover Tesla's implementation.  An attorney will likely be able to walk you through that.  It is probably less likely for you to hear uninvolved third parties' opinions on whether patents are moral, which HN will provide you in spades.", "Hate to quote myself, but see the P.S. here: http://news.ycombinator.com/item?id=5568610If I were a gambling man, I'd say this is quite likely to be shoe #1.", "I'm a Rails developer, not a PHP developer (well, I can do it, but when I catch myself doing anything more than editing a WordPress theme I stop and ask what went wrong).  That said:+ PHP is universally supported, virtually out-of-the-box, on virtually every architecture, distribution, web server, hosting company, etc etc etc you could name.+ The deployment story for PHP apps is better than it is for e.g. Rails apps, particularly if you have, um, people who are not primarily technical in charge of it.  For example, if you can follow instructions, you can install WordPress, and it will take you about five minutes.  Given a functioning Rails application and told to put it on the Internet, and assuming you're a competent systems engineer, allocating an afternoon to the project is not a bad idea at all.  (Unless you already have made the upfront investment in e.g. Chef/Puppet/etc scripts to configure everything your app will need to get running.  I have a project where I haven't, but I've got pretty good documentation on what needs to be done to bring up the whole environment, and it takes me 2 to 3 hours to do.)+ Programmers are rare.  Programmers close to your are rarer.  Programmers close to you willing to work for what you're willing to pay are rarer still.  Yadda yadda.  All of this is true about PHP programmers but they're about an order of magnitude or two more common than e.g. Rails programmers.+ Even if we concede that PHP is a language comparable to duct tape and bubblegum, I've got to point out that a lot of the world just needs duct tape and bubblegum.  There is a web service running at my old day job, where hitting a URL is supposed to tell you when the most current backup of the database was taken, and that's it.  It is written in PHP and was coded, tested, and deployed live in approximately as much time as writing this comment took.  Rails -- which I love! -- is not a very good hammer to hit that nail with.  (I've got an app or two on Sinatra internally, and while I like them, they feel inferior in this case to \"We already have Apache up.  Copy/paste one file and forget this was ever a task.\")", "Consider it the creative application of computer code to systemic weaknesses in the global economy, with a clearly defined success function which is fairly difficult to fudge.  That might help explain some of the attraction.  (There's also the \"If you only know W-2 employees, then making money by a legitimate means other than a day job feels like cheating\", and for some reason a lot of hackers like winning by rules exploitation more than they like winning.)", "Some options:1)  Do you have freelancing or other experience which has exposed you to multiple people with similar problems?  For example, have you implemented the same \"$()#% authentication system for a web application 20 times?  Package up that one little piece of the puzzle into a scalable way to teach people to do it without needing to have you or someone similarly skilled on their team.  Common form factors include ebooks.  Sell the ebook.  If you want to sell lots of the ebook, start by offering some free incentive to get people to trade you their email address, then send them email about $TOPIC for a while to make them trust you as an authority on it, then ask them to buy your thing.  (Note: You don't have to be the world's leading expert on building authentication systems.  You've just taken somebody's shilling to do it twenty times, which means that it is likely much, much cheaper for somebody to buy your thing and hand it to his junior developer than it is to pay a similarly-experienced engineer to do that part of the system.)2)  Failing that, talk to businesses.  I could give you a vague fact pattern to ask about (a problem which is amenable to a solution with code) but people seem to get hung up on that so I'll give you something really specific: you are looking for a MS Excel spreadsheet which has ever been mailed by Bob to Cindy, had Cindy edit it, and mail it back to Bob.  Every time this happens a SaaS app gets its wings.  Now go out and find, in the actual physical world, ten firms which have that same darn spreadsheet.  Offer to build them a software system which solves the business problem which that spreadsheet represents.  Ask if they would pay (pick a number based on how big the firm is) $50 to $250 a month for it.  If yes, ask them to commit to buying it when it is ready.  If you get 5 commits, build it, sell to them (n.b. you'll lose some commits here), and then start trying to sell it in more scalable Internet-y ways.3)  Failing that, Bingo Card Creator, an app which does everything wrong in terms of business model and market selection, sold ~$1k a month something like 6 months after launch just because I got halfway decent at organic SEO.  If you're willing to get good at one generalizable acquisition strategy (SEO, Facebook ads, AdWords, etc etc), with that wind behind you even turkeys can fly.  (It often turns out that there are more lucrative options than pushing turkeys around.)4)  Find or create one proprietary data source which is not currently exposed to Google which answers a question that demonstrates commercial intent.  Expose that proprietary data source to Google.  The federal government has approximately 100,000 CSV files of interesting data which are not helpful to someone asking questions like (not a good example site, but a great example of there-is-an-answer-to-this-buried-in-a-free-CSV) \"What is the median salary of mid-career dentists in Topeka, Kansas?\"How you monetize a site like that depends on the specifics of the niche and how savvy you are about it.  Lead generation is very lucrative, if the question you're answering tends to suggest near-term commercial intent in something with a liquid market.  If you want to make a lot less money in a braindead simple fashion, just slap adsense on it.Also, I think I alluded to this above, but anybody capable of executing on any of these has ipso facto developed skills which can be employed by Real Companies with Real Budgets to make hundreds of thousands of dollars in marginal revenue.  I know you said you want passive options but more active options, like selling consulting, are things that might well fit where you are in life a few years down the road.", "I think it would be challenging to duplicate Patrick's extremely low-cost and synergistic SEO strategy with a SAAS offering that was not so text-centric.Many people have reported to me that variations on it have worked out quite well for them.  I mean, yes, you might spend 10X or 100X what BCC does on content creation (~$3k over 8 years), but that's very justifiable for a lot of SaaS businesses.Other people report to me that they've had substantial success with similar strategies in SaaS.", "1a)  \"Hey data.gov, what information do you have available?\"http://catalog.data.gov/dataset?groups=consumer9350The very first data set is health insurance estimates broken down by zip code.  There's a super-lucrative market for you, but that one might be a bit competitive for you trying to crack it in 2013.  Let's see, scroll down a few results...ftp://ftp.cfda.gov/datagov/programs-full-datagov.csvThat's a full listing of government programs which are designed to give people money.  You could transform that opaque, disorganized CSV file into an easier-to-consume .org site to educate people on how to apply for government grants, right?  And you could run ads on that site, right?  (I think it is likely that the type of ads you'll get on that specific site would be scummy as heck, but there's another 75,000 CSV files listed on data.gov, so do a bit more searching and find a better one.)1b)  Assuming you have picked good questions to answer, you monetize by connecting people who have demonstrable interest in spending money to people they can spend that money with.  That could be directly with you, if you have a product which answers their needs.  It could be with other folks, via selling leads.  It could just be with Big Daddy G, by putting AdSense on the site, bankrolled by people who have the business model that you haven't implemented yet.2)  I actually wound down the consulting business.  Long story, but short version is that I want to focus more on my own stuff.  Having years of material and successes I could point to certainly helped me land gigs, but way back in the day, the only thing I had going for me was that BCC appeared to work and I could explain why.  If you hypothetically had a successful side project, that can probably be parlayed into \"I could do something like this for you, where it will be substantially more effective because it will take advantage of the X, Y, and Z advantages your business has that mine didn't.\"", "That is a partial option, but there are ways in which it is inadequate.  For example, with the January Rails vulnerabilities, dropping an IMG tag with a well-constructed URL on a site on the public internet was likely enough to suborn a developer's browser into connecting to and rooting a Rails box that was firewalled from external traffic.  You still want to patch things, to prevent that and similar issues.", "I would pay to hear this talk.", "They're contractually obligated to support it for at least a year for me, and after that commercially viable software is commercially viable software.", "That's unfair.  Consider, hypothetically, a case where there is publicity on a subject that a Matasano employee has specific expertise about but which is also not orthogonal to Matasano's commercial interests.  You can stipulate, if it helps, that the hypothetical employee is younger or less senior in the organization.  They might reasonably decide to post something about that thing on HN or Twitter, and then follow it up with an out-of-an-abundance-of-caution disclaimer to head off any trouble at the office, right?  That isn't double-secret-squirrel drama seeking, that's just trying to adapt to the weirdness of life as an employed social animal in 2013, where you have an ingroup-you and a public-you and occasionally they have to be both present in a conversation at the same time at cross-purposes to each other.", "So, for the benefit of everyone reading this: Not urgently needing the money, and not communicating that one urgently needs the money, is one way to avoid having this happen to you.For your benefit:a)  Asking for partial payment sends a bunch of signals regarding your level of professionalism and need to see this check.  Those signals are not helpful in getting you paid in a timely fashion.b)  Two weeks late is practically on time for a lot of clients.  Many are just structurally incapable of getting checks cut that fast.  Yes, insane, but also true.c)  I'm uncertain of the status of the project and your ongoing relationship with the client.  Please note that escalating to lawyers is not in general something which improves client relations, if you wish to get more work from them in the future or if you have an ongoing work relationship for e.g. future milestones.d)  Prior to escalating to a lawyer, write them a short letter yourself and FedEx or courier it to their office.  Pay the extra for signature confirmation of receipt.  Contents could be similar to:Dear $DECISIONMAKER:I invoiced you ($IDENTIFYING_INFORMATION) for $AMOUNT on $PROJECT on $DATE, but to date have not been paid.  Last week I spoke to $NAME and $NAME, who promised to handle this issue, but it remains unresolved.The invoice is due immediately.  I would prefer that we resolve this amicably without having to bring lawyers into it.  If you have any questions, please call me at $CONTACT_INFO.Regards,$YOU", "Feel free to ask me for elaboration if you need any, in particular if you have a CTO or other bosscritter who you need help convincing of the importance of this.  It will be seriously bad news for you if you stay on unpatched 2.3 over the next several months.", "I do not have, nor possess non-public knowledge about, unpublished vulnerabilities in Rails 2.3.  I am just saying that my confidence in there existing one in the near term is \"near total.\"", "Did you consider this as a potential business opportunity for yourself?For a few minutes.  It has poor alignment with my skills (I'm a fairly decent developer and can play a security researcher occasionally, but I'm a lot better at selling/marketing software than I am at hardcore framework development) and desired lifestyle (to whit, not wanting to be up at 4 AM in the morning having to work on Rails security issues -- today excepted, apparently).  It also wouldn't play well with my plans to dedicate most of my business efforts to AR going forward.It seems more like someone should be giving you either cash or equity for your roles as both an evangelist and the person who realized this was going to be needed and organized it.I don't take money for publicity, as a matter of policy.  The idea is worth about as much as the tweet it takes to describe it.  The only interesting coordination problem is matching up Customer Zero with a company interested in and capable of doing the work, and that would be worth compensation, but for the fact that I was Customer Zero.I did briefly entertain the notion of banging down a few doors and selling this (on some model like \"I'll guarantee you X amount of business, in return I get a payment of $Y0k when I bring it to your door\") but, meh, I'm just not that interested in doing enterprise sales for things that I don't own.  Heck, I can scarcely be bothered to do it for things that I do.", "I have approximately 10,000 reasons to personally prefer Rails continuing to support 2.3 out of the goodness of their hearts, but I don't think that satisfying my (and other users') selfish desires is necessarily \"better\" than not doing that.  It is necessary and proper that the project have priorities, and those aren't going to be optimal for every user every time.I am quite happy that they were really explicit about \"We are dropping support for 2.3 when 4.0 lands\" so that those of us who depend on 2.3 to eat had months to explore other options prior to needing them urgently.  That's something that many OSS projects can and should emulate.", "They're, if I recall correctly, a $X0 million [edit to add: crikey, checked stats: $500 million a year at the telephone company alone] a year business in Japan.  The overwhelmingly most common use is sending a message similar to \"We regret that we were unable to attend your wedding.  Best wishes to the bride and groom on their unending journey together.\"  That will run you about $20.  For an extra $30, you can send the telegram with (e.g.) two dolls of Micky and Minnie Mouse dressed in bridal attire holding a scroll case for the telegram, so that it can be held on the gift table until the bride and groom have the opportunity to read it.Of course it's inefficient.  That's precisely the point.", "That wouldn't actually surprise Marxist (&tc) critics of capitalism that much.  I'm largely not persuaded by their worldview but they have some solid insights on organizational structure as an emergent system of control.", "How much do you think Barack Obama trusts Scott Wensing?Barack Obama cited Matt Wensing by name as an American innovator solving American problems in a public speech, but to your point, several years ago the decision to use StormPulse in the White House was made by a GS-whatever with a nondescript .gov email address, and it was certainly not made due to StormPulse's superior access to the Valley in-crowd.  (Disclaimer: I invested in them.)", "Nobody will read transcripts.  Few hiring officers read resumes.This issue is vastly, vastly, vastly less importance to your success with your job search than meeting and making an impression on people with hiring authority is.  The default response to an unsolicited resume is for it to be silently discarded.  Rather than making that the focus of your efforts, start identifying people you'd like to work for (or companies and, by extension, the people within them with hiring authority) and pitching them directly.  Your conversations will be much, much more interesting than anything on your resume or any response to it.", "I stabbed the upvote button so hard I may need a new mouse, in particular for the encouragement for the side project to sustainable business trajectory.  I did that.  It was, no lie, lifechanging.  (And I started with a business which many, many people assume must be a joke.)", "In general, talking to customers, shipping software, and selling things to people for money strictly dominate either thinking beautiful ideas or wondering what alchemy would hypothetically make your startup fundable.  If you're really, really interested in that question, I can explain it in detail, but I would bet against you liking the answer, so I'd suggest talking/shipping/selling rather than spending more time thinking about what other people are doing.", "There are far easier ways to get money than raising money for a startup.  If two founders raise, say, $500k, under most circumstances they'll work a lot harder and earn a lot less than just working for Amagoobooksoft as engineers.  (Remember, it doesn't magically become their money.  They'll be expected to spend it on employee salaries, and employees are much, much more expensive than anyone who doesn't have employees thinks they are.)  I wouldn't get too jealous of their lot in life, because it will cloud your judgment.Is it just guys that have too much money and fund startups hoping that 1 in 100 of the funded ones will eventually make them billionaires?Again, you're letting sour grapes color your perceptions here.  Broadly speaking: \"Make lots of bets, lose lots of bets, but have some money invested in [without loss of generality: Google]\" is, in broad strokes, the model.  Note that there is no reward for being original.  Google wasn't.  (\"Another search engine?  Please.  And their portal is much worse than Yahoo's.\")  Facebook wasn't.  (\"So it's like MySpace but with 1/1,000th the users?  Great idea, Harvard dropout.\") etc, etc.In terms of what makes a startup fundable: http://venturehacks.com/articles/unfundable-startupIn general, with exceptions which would be pretty obvious to a hypothetical founder if they applied, a hypothetical founder is fundable if:+ They are located in proximity to investors who routinely fund companies like theirs+ They are addressing a market with potential to make $10M ~ $100M (seed stage, angels, and early VC funding) to $X00M a year in revenues, at a minimum.+ They've got a team who \"look like winners\", for very subjective versions of that.  Graduated from a good school, worked for one of a few firms with known high hiring bars (AmaGooBookSoft, etc), had a high-impact role at a previously successful startup (first hire or first VP engineering at a company which exited or is a shoe-in to do so, etc), etc etc.+ They are clearly capable of shipping great product.  What makes a great product?  Um, investors \"know it when they see it\", but suffice it to say that high-caliber design is very big right now.+ Traction.  In brass tacks: $X0,000 of monthly recurring revenue or millions to tens of millions of free users but growing fast.  Less at early seed stage, but you should ideally be able to demonstrate it in micro-scale.  (e.g. If you can show $1,000 of ad spend got you 4 customers and their LTV is probabalistically above $1,000 then you're in a much better position than if you can't, even if $4,000 doesn't really ring any bells for investors.)Now, let's contrast this to a hypothetical guy.  Guy has big dreams.  Guy probably has not shipped a product.  If Guy has shipped a product, Guy got 20 people to look at it once, but no one still uses it.  Guy lives in the Midwest.  Guy graduated from a respectable (but not name-brand) school.  Guy worked has worked the last few years as a freelancer.  Guy has not convinced a second guy to join him on his crazy adventure.  Guy has an idea which Guy thinks is awesome but which Guy has not succeeded in actually selling to 10 customers or instantiating on the desktops or home screens of several thousand users.Guy will have a very, very difficult time raising funding.", "No, the Tulsa of Japan is 11 minutes away on the train.  I live in the Norman, Oklahoma of Japan.  (Come over and I will give you the tour.  It, uh, won't take long.)", "Thanks HN, this was news I could use.  (I didn't turn out to have anything vulnerable, but certainly could have.)", "Apropos of nothing: One of the classic elements of successful frauds is making the mark believe that they are pulling one over on the fraudster.  (Take a look at those loan terms.)", "It supports substantially more complicated movements of money.  Stripe Connect is basically \"Bring your own Stripe account.  We handle the API integration for you.\"  This lets you do things like (hypothetical case for Airbnb-clone) \"Pay the room lister 90% of the amount charged 5 days after the later of 'satisfactory feedback received from renter' or '10 days after checkout'.  Then, pay us our 10% fee for enabling the transaction.\"Bonus: with this, the lister doesn't need a Stripe account and will perceive all of their interactions with money being handled by you or their bank.  This means you don't have to, as a part of making the sale to them to list their room, convince them \"You should really open a Stripe account.\"", "While the data is interesting, my understanding is that pales to: if your posts get Liked, you keep using Facebook, and if your posts get disliked, you stop using Facebook.Some people think Facebook is a drama creation engine.  That's a bit unfair: it's a usage creation engine, which does allow usage by people who are prone to creating drama.  (Talk to e.g. teens sometime: for some people, implicit competition within real-life friend groups for who gets the most likes on their photos is A Thing.)  Facebook is not unaware of social patterns like this, so they make product choices which make them less likely to negatively affect Facebook's interests.", "Forums, like social networks, are networks effects businesses.  HN grew from a seed set among YC people, applicants, pg's essay audience, likeminded individuals.  After there is a community and conversations, they pull in other people.  (I randomly got drawn in when someone referenced my blog some years ago, and I just happened to stay.  etc, etc)Assume you have the magic wand of product design.  You wave it and create The Best Forum Ever.  That's great.  I don't use it because I use HN and you have no reason for me to switch.  People who want to read what I have to say can't find what I have to say on your forum, because I'm not on it.  Sum up that interaction over the entire space of possible users and it leads to a forum with 0 users and no content.If you (hypothetically) want to create a competitor, your big problem is not creating a better designed website.  It is, instead, convincing a seed set of users to use your new website even in the absence of much content on it, and having those users be such wonderful/connected/popular/thought-provoking/etc people such that people will join your site just to hang out with them.", "The desktop client is indeed written in Java Swing.  Fun fact: for PDF printing and getting updates, it actually does interact with a web service in the Ruby on Rails application.  Both are ungodly bits of code put together years ago which shame me but seem to continue functioning.", "I'd encourage people to think of this less as \"Wow, she misinterpreted a series of options and got progressively father from her goal state until it was unrecoverable; sucks to be her\" to \"This is computers as perceived by people who do not make a living making computers work, and we should anticipate them not always understanding our applications and design them to facilitate understanding when possible and make correction easy when not, to the maximum extent possible.\"", "We have perhaps a different read of the current page of comments, where it strikes me that a lot of people are playing blame-the-user, a game which does not build companies.", "See also: http://www.dangerouslaboratories.org/radscout.html(There's a sad coda at the end where the kid did not learn the lesson about the wisdom of scratch-building nuclear reactors out of foil and smoke detectors.", "1) To that speaking slots are allocated socially, that (correctly) suggests that one should network if one wants to get more speaking gigs.2) It is wildly not the case that all speaking gigs begin with having an in with the organizers, just like it is wildly not the case that all jobs or contracts are awarded to nephews.  Pitching is an art.  Doing it well will raise your hit rate.  Failing to do it at all, while either waiting for the world to recognize your genius or bemoaning the unfairness of it all, is an incredibly effective method to not get speaking gigs.", "Can I ask you which part of that you're having a problem with?Can you identify a business problem a taco truck has?  (I'm assuming taco trucks are something within your experience.  If not, assume I said \"the last restaurant you ate at\")  Even if you know nothing in particular about taco trucks, you can go the the reliable old standby that absolutely every business in the world feels its revenues could be higher and its costs could be lower.Let's focus on revenue.  Do you understand how a taco truck generates revenue?  They sell tacos (and some other stuff), at a particular price.  If they sell more tacos, holding price equal, their revenue goes up.  (Take on faith that tacos are incredibly high margin and that selling more of them is a win, OK?  I strongly believe this to be true for the typical taco truck.  If you don't know what high margin even means, that's fine, because it doesn't change this analysis.)So our problem is now \"Sell more tacos, with software.\"  Can you do that?  If not, ignore the software bit -- can you dream up ways to sell more tacos?  Can you just brainstorm twenty of them?+ Get more people to hear about our taco truck.\n+ Always ask people \"Would you like a second taco for the road?\"\n+ Sell tacos at a better location.\n+ Sell tacos to companies in big batches, then anchor your retail business at the company's location for a day.\n+ ...Now look very hard at your list.  Is one or more of those amenable to being implemented, in whole or in part, in software?  I suspect the answer would be yes.You don't have to be bitten by a radioactive spider to make businesses money, and it equally doesn't require superpowers to do that with software.  If you absolutely, positively feel you can't do it, I strongly suggest working in industry for a year or three.  Any industry will do.  Applying technology to discrete problems is a learnable skill.", "I use something very similar to your system, but people who know better will tell you that your admin functions should be at a distinct app at admin.example.com, which you'd make only accessible to people VPNing into a gateway box which does nothing but VPN.  You can secure them normally after that, independently of the service proper.This prevents a variety of attacks, such as leaving as XSS anywhere in your application, from causing you to lose th le admin console.", "I'm on an iPhone and going to dinner in a second, but can someone tell them that Gem::Requirements line is a pretty dead ringer for the YAML exploits from January?  Servers that haven't been owned yet should update Rails, see my article from January.  Owned servers need to get rebuilt from metal, as per usual.", "We get IP ownership, but we don’t bill for our time at all. Instead they become our first customer to use the new tool for a lower yearly fee (including maintenance).You're taking on market and execution risk here, for which you are not receiving compensation.  (Presumably you set your consulting rates high enough such that engagements are a win for you.  The SaaSification option is at a discount to your rate, which you only make up if you sell it to other people.  \"Selling it to other people\" is often much, much more difficult than writing working software.)Any consultants in the room who happen to have an engagement which would create usable IP could consider the following alternative: \"You pay our normal rates, and you pay for hosting/maintenance, and we own all the IP.\"  This is actually very common, because most customers of software do not want to get into the software business and hence they don't give a fig nutton about commercial exploitation of this system they want to buy from you.  No purchasing manager at the US federal government is going to nail his promotion to GSWhatever if he preserves the government's call option on starting a SaaS starttup.", "Who is paying that much and for what?There's a cottage industry of firms specializing in conversion rate optimization for X.  (My consulting practice was in no small bit doing this for B2B software firms.  \"Conversion optimization for e-commerce\", \"conversion optimization for insurance industry\", etc etc are also common specialties.)If you were hypothetically a client desiring top-tier talent, and you asked what $400 an hour would buy you, I'd say \"One journeyman at a boutique firm... if you can find anybody with availability at that price.\"  I was priced rather north of that for some of my consulting career.  There were likely folks priced at a substantial premium to me.There are substantial programming/design skills implicated in this, obviously.  (At some firms there is specialization of labor but at boutique firms typically all consultants do everything required to ship.)Edit to add: You asked who is buying this sort of thing.  In my case, largely B2B software companies with revenues in the $10 to $X0 million range.  In broader terms, almost every company which either does direct transactions or collects leads with value over $1 million per year should probably be buying this sort of consulting, and many of them do.  What's your guesstimate on how many insurance companies there are which sell direct-to-consumer products in the US, for example?  All of them are potential customers are this.", "That's a post I've been meaning to write for a while.Back before I had a reputation as a fairly decent (tech conference) speaker, I had a proposal which was accepted at the Business of Software, which was a bit of a reach for me honestly.  I'll find the exact text if anyone is interested, but it hit three bullet points:1)  Social proof that I had something interesting to say (I run a blog, somebody you the conference organizer knows has cited me favorably before)2)  A one-sentence pitch for why my topic would be interesting and topical for the attendees3)  The (accurate) prediction that people would talk about my talk even after the conference was over, because (for a for-profit conference) this helps accomplish their #1 business goal, which is selling more tickets for next year (n.b. point #1 also speaks to selling tickets if you can claim an audience which will follow you to the conference)", "There's probably ten thousand things that you can do with a telephone which can be offered to a business as straight-up monthly SaaS, and even more ways to embed a phone call/SMS into a business/product.Seriously, if you lack for ideas, pick a business and enumerate all the calls they are likely to make.  Anything where you use the common pattern of \"Speak to an employee, as an alternative to a REST interface\" is likely amenable to Twilio-ization.", "Example: I used to work for a large office supply store.  The most common phone call was \"I ordered something from you on X.  When does it arrive?\"  You know what I'm going to do, right?  Ask you for enough identifying information, find your order in the computer, and then read you the expected delivery date.The most common outgoing call was \"Thanks for your fax order.  We're calling to confirm receipt, tell you that you didn't calculate the total correctly and the actual price is $42.06 or $3 less than you expected, and inform you to expect delivery tomorrow.\"  This phone call routinely took 20% of order entry time.  Everything in that phone call just used me as a voice interface to our database.A Twilio app would have obsoleted an entire floor of employees at that company.", "For many technologists, $39 is a very small amount of money relative to many things they could compare it to.  (For example, the implicit cost of learning the new JavaScript hotness.)  The audience of professional developers who can spend $39 is quite large.  For example, if you're ever at a developer event, look for the folks with the hardware with the fruit on it; they're universally capable of paying $39.   The fruit company does not appear to be hurting for market share.", "I empathize with that feeling, but would point out that if they were people, Intel would be getting yearly prostate screenings, Accenture would be retired, and Nintendo would be dead.", "\"As a vegetarian, I don't like how you priced your hotdogs\" should not weigh too heavily on any of the hotdog makers in the room.  This comes up quite a bit here, for example when people who do not own businesses opine that $200 a month for a Business plan of SaasFoo shocks the conscience.", "I worked with Dr. Loui for a year-uh on research projects after loving his undergrad AI class.  He's crazy -- like \"A demo to the customer is not working?  Let's edit that in real time then reload, proving why scripting languages are better.\" -- but he's a very useful kind of crazy.I think that Ruby/Python are the spiritual descendants to this argument in 2013, by the way.  e.g. A class project was to scrape eBay and predict the winnin bids on a variety of item classes.  (Spoiler: \"the current bid\" outperforms most algorithms.). With AWK, you scrape the HTML and do some ugly parsing.  Of course, with Ruby you'd hpricot a single CSS selector and have the lab 80% complete in ~3 lines.The single greatest disadvantage to using AWK for serious work is that nobody but you and Dr. Loui does that so you get to invent everything for yourself every time.  (You probably do not appreciate how much your language ecosystem bakes in code re-use until you've used a language that assumes essentially all use is one-off, by the way.)", "\"They excuse the fact that he killed people, because he is attractive\" seems to be a sanity-saving reading of the anecdotes, here.  The much more straightforward reason is \"They are attracted to him because he is a killer.\"You could find a hundred kids at MIT who fit his general description.  What's your estimate on the mean number of Facebook groups created by fawning fangirls they each have?", "I agree with the conclusion, but the even more wildly actionable information is that you can decrease CS costs and increase customer happiness by using copywriting better than \"That email and password do not match our records.\"  (Also, as a product owner with an engineering background, I have to come  down on the \"In this case, prefer UX over security\" side of the debate, since there are numerous other options for divining existence of an account/email address and refusing to tell the account owner that gets you no marginal security benefit but does frustrate their use of your system.)", "After having said something out-of-school ~10 years ago as \"patio11\" on a forum and having someone track that down via not-so-difficult Googling (since I use \"patio11\" approximately everywhere), I resolved to eliminate the ambiguity and assume that anything I post under any patio11 account goes on my permanent record.  Ironically, while it certainly didn't feel like it at the time, this was probably a net win for everyone, since I'm a much more pleasant person to be around on the Internet these days and my Internet reputation has been frequently useful professionally.", "For anyone who thinks death from overwork merits scare quotes: I really, really can't recommend becoming a salaryman, but it would change your mind.", "If you produce meaningful business value in 2~4 hours, just charge for the day.  Butt in chair is not what they are buying from you.  If they wanted cheap butt-hours you're already not cost competitive.  Instead, deliver what they're asking for and don't worry them with irrelevant trivia like your fluctuating time-costs at different stages of the product cycle.", "Thomas got me to do it and later preach it.  It's a virtuous cycle!  (Also, charge more.)", "If there's one social norm I'd love for HN, it would be \"If you build things, we're on your side.\" (I hope that the normative intent of this is clear enough to not require 2 paragraphs of inoculations against nitpickery.  On second thought, if there were two social norms I'd like for HN, that plus \"Default to not nitpicking.\")", "Fuel costs are essentially linear with regards to weight, and accordingly dominated by putting several hundred tons of metal in the air.  After you've made that decision, adding a marginal passenger is much, much, MUCH cheaper than the price of a ticket.  The margins approach that of the last customer added to a SaaS company.  (!)Airlines occasionally obscure this with regards to their public pricing rationales for extra luggage, but that is almost solely an ops/revenue-maximization problem for the airline rather than being sincerely a proportional response to the additional marginal cost of putting another bag in the air.", "The prevailing theory among air carriers is that demand for flights is totally exogenous to the industry and allocation of flights between carriers in the industry is, for most customers (e.g. not frequent business travelers, who are price insensitive and care about mileage), dependent pretty much solely on price.  Accordingly, minor decreases in comfort which add capacity are pretty much an auto-win.Many people dislike this conclusion and dispute it's factual accuracy because they don't want to believe that they'll predictably increase their own agony to shave $5 off a ticket.  But, well, non-experts opinion of their own behavior often does not have 1 to 1 correspondence with reality which is tractable to measurement with numbers."]}
