{"comments": ["Manning was arrested in May 2010 and his first preferral (the UCMJ equivalent of indictment) was issued in July 2010.", "I wish people could stop conflating normative and descriptive arguments on HN, and I wish the textarea where HN comments were entered included a summary of the Fundamental Attribution Error fallacy. This comment makes both mistakes.", "I had what I think was a related problem with file descriptor retention in timeouted socket code when writing a simple portscanner in Golang; I had to implement simple time-based flow control to give the runtime time to collect file descriptors, or I'd run out of them.", "An argument that it's a fake issue: the fact that best-practices compliant HTTP applications already tend to run under HTTPS, and that understanding what's happening at an HTTPS level in operationally-relevant ways (namely: are we performant enough? and are we secure enough?) already requires parsing of that binary protocol.", "Don't confuse the cart and the horse. The IETF standardization process has never been less relevant than it is today. The reality of deployment of a \"next-generation HTTP\" involves two things, neither of which the IETF has any say in: (a) whether anyone can improve HTTP as it runs between a mainstream browser (or some as-yet unforeseen browser replacement) and a content serving backend in a way meaningful enough to drive adoption, and (b) buy-in from the major browser owners.That's the way it's supposed to work; the horse is meant to drag the cart. The RFC database is littered with cart-led insurgencies that went nowhere. If binary HTTP is one of those, it'll join them as a historical curiosity.", "I suppose that's a valid concern, but note that Google's control over the protocol was already pretty strong by dint of running Google.", "You mean like how virtually all of consumer software development now happens either on the web or on a platform that didn't exist until 2007?", "What does Google's involvement in advertising have to do with the design of the SPDY protocol? Can you make a substantive criticism of SPDY based on Google's advertising incentives, or is this just innuendo?", "A reasonable argument would say that we don't need the social and political stuff in standards discussions, which should be based instead on engineering.", "I think it's fair to argue that a company's purpose is best illustrated by its revenue streams. Reasonable people can disagree depending on the circumstances.", "Could you please share some of the technical criticisms of SPDY that you find most compelling?", "I too have unreserved respect for PHK as an implementor. I'm not sure I find his critique compelling. It seems to me that it distills to a couple simple points:* SPDY depends on Deflate compression, and will require middleboxes to implement deflate to route requests. I think the \"IETF school of design\" has an irrational fear of good compression and I think it's harmed other protocols, most notably DNS. I may be poisoned into this viewpoint by Bernstein.* There are protocol constants that PHK doesn't know the background of, which strikes me as the kind of documentation bug that something like an HTTP 2.0 would address.* SPDY might have required another WKP, which isn't really a SPDY problem.* There's DoS potential in SPDY --- but of course, there's DoS potential in HTTP too; look at chunked encoding, for instance. For that matter, modern HTTP 1.1 also accommodates compression; when it comes to attack surface, in for a penny, in for a pound.* A similar argument addresses PHK's concerns about the (theoretic) security of the push model, which is also something that modern HTTP accommodates.Later:Oh oh also: PHK sees HTTP 2.0 as an opportunity to correct the session management problem, which has led to the \"bass ackwards\" design of heavyweight signed cookies in web applications. I sympathize with him on this point, but it's not HTTP's fault that this happens. HTTP 1.1 cookies also used to be simple opaque session IDs; heavyweight signed cookies are a consequence of server app architecture, not the underlying protocol.Even if HTTP 2.0 had built-in robust session management, Rails apps would still be shoving several kbytes of encrypted state out to web browsers.", "Google is the industry's most active and effective corporate advocate for TLS. They're one of the key drivers for certificate pinning and one of the earliest mainstream deployers of forward secrecy. So I think that argument is a little bogus.I don't understand the first point, though. Could you clarify?", "Sure, but SPDY is a TCP protocol, and so inherits TCP-friendliness from that; I'm just not seeing what that has to do with HTTP.", "I wish I could somehow CAPTCHA comments like these so I could tell if they were people or Markov generators.", "The problem is having to build your own random number generator at all, and it's a consequence of doing cryptography in browser Javascript.Designing a robust CSPRNG is as hard a problem as designing a block cipher mode or a MAC; it's \"systemsier\" than designing your own block cipher core, but about on par with coming up with a simple authenticated encryption mode. By way of example, CSPRNG design gets extensive treatment in its own chapter in Schneier and Furgusen's _Practical Cryptography_, and it's one of the few chapters that highlights the authors own work.Cryptocat uses JS inside of a Chrome extension to avoid the chicken/egg secure load problem (I'm ambivalent about this approach). But Chrome extension JS doesn't avoid the other problems of browser Javascript crypto, and here's an example of why: it forced Cryptocat to attempt the design of a custom CSPRNG.", "It is the unfortunate de facto standard for built-in noncryptographic RNGs in high-level languages. PHP, Python, and Ruby all rely on MT generators (all 3 have real CSPRNGs too).", "You should definitely actually try to clone an MT instance sometime. It's illuminating, and just tricky enough to be fun without being frustrating.", "I am totally, completely in the dark as to which coding errors (there have been several in the past few months) attach to which CVEs and which versions, and about when these vulnerabilities were reported to the project and when they were subsequently disclosed. I can't be the only one confused, and I do wonder whether that confusion is strategic.Pointing this out would be be gratuitous, except that Cryptocat's project leader has very high standards when it comes to the disclosure behavior of that project's competitors:https://github.com/SilentCircle/silent-phone-base/issues/5(Cryptocat is \"kaepora\" in that thread; the context there is that Mark Dowd had reviewed ZRTPCPP, an open source implementation of the ZRTP protocol that Silent Circle funds and relies on, and found several memory corruption vulnerabilities. Mark had gone public with those vulnerabilities quickly as a result of a miscommunication with the Silent Circle team, but then redacted his disclosure and agreed to embargo the findings while Silent Circle coordinated fixes with all of the Silent Circle competitors that relied on that library; what you see in that thread is, apparently, the lead developer of Cryptocat, which doesn't use ZRTPCPP, repeatedly criticizing Silent Circle's handling of the incident.)The project should meet the standards that it has loudly set for others, and I don't think it has. I'd be happy to be corrected on this.", "My concern is substantive:In the process of handling an embargoed disclosure, Silent Circle groomed (perhaps aggressively) a Github pull request thread. Handling a coordinated disclosure on a Github pull request is tricky under the best of circumstances, but the Silent Circle team was dealing with an unplanned partial disclosure and was, with Dowd's cooperation, trying to get the genie back into the bottle long enough for (from what I can tell) their competitors to get patched.This was, as is evident from the thread, a problem for Cryptocat's uninvolved, un-implicated lead developer.Meanwhile: I cannot immediately tell from the record which of the independently discovered vulnerabilities in Cryptocat correspond to which CVEs or which advisories and which severity descriptions.The problem isn't one of demeanor; it's that I can't tell what's going on with this project. Does this sound fiddly? Let's make it more concrete: did an exploitable vulnerability get reported to the Cryptocat project, mitigated in a public Github commit, and sit there for months without any acknowledgement from the project?Cryptocat's project leader is an HN commenter, and if this confusion is my own doing --- totally possible --- I'd be happy for some clarification; not about Silent Circle, but on how someone would get a record of what vulnerabilities were disclosed in Cryptocat, when, and what the timeline was for each from discovery to public disclosure. It's plausible that there's a clear record somewhere and I just missed it.", "Also that Canadians also celebrate a national nostalgretz day, just on different days and by surprise. Sounds about right!", "If you're going to continue using Google Mail, it's a dumb idea to deliberately switch away from Chrome. The connection between Gmail and Chrome is among the more carefully guarded TLS connections on the Internet.", "My comment didn't say \"nobody can break free from gmail\", but I'm happy to provide a coat rack on which to hang that argument.", "By controlling both sides of the connection, and by investing in people like Adam Langley. And yes, other sites should. Not \"control both sides of the connection\", which is unrealistic, but in modeling their server configurations on Google's so they can take maximal advantage of Chrome's TLS features.", "Google does that for a number of other non-Google sites, too.", "Be less sure. Google provides certificate pinning as a service to other sites, who request it specifically.", "If you think you can do as robust a job at securing your mail as Google does with Gmail, by all means. But I'd feel awfully dumb if I migrated from Gmail to some other web mail provider only to lose my mail to a 17 year old with a Perl script.", "If you really bet that, it says more about you than me.But anyways: what does it matter if your webmail provider isn't beholden to the government, if a suitably motivated teenager can read your mail because of software vulnerabilities?Google Mail isn't likely to be more secure just because Google is inherently better at building software than anyone else. Rather, it's because they allocate more resources to the problem of keeping Google Mail secure than any other mail provider does (or even can) allocate to their security.", "Yes. A pro friend of mine is fond of saying: budget 10x to design, 1x to implementation, and 10x to verification.", "This isn't a disclosure of a new vulnerability; it's a followup on an earlier article which documented a much more significant problem with key management in Cryptocat.", "I upvoted this because, of course, it confirms my own biases, but kind of wish I hadn't, because we're not helping with comments like these.", "I agree. I think the problem isn't how the code is implemented; I think it's how it's designed and verified.Most of the time, generalist developers can severely (sometimes even completely) mitigate the expense of competent design and verification by adopting trusted components and adapting the application requirements to those components (instead of the other way around, which is the usual way developers incorporate third party components).If you don't do that, though, you're looking at the 10x-1x-10x problem: however much time it takes you to build your system, you're looking at a 1:20 ratio of effort for non-implementation work, and that's serialized.(Lest anyone thing I'm talking my own book here: we do what I think is an atypically good job at handling the ancillary crypto stuff that comes up in normal applications, but I don't think we're well qualified to do formal reviews of cryptosystems.)", "I don't think the problem has much to do with how good a programmer you are.", "I think the project is worth criticizing, but that the concerns are serious enough to deserve better than snark.", "I'll take a stab:No court in the US is meant to make law. All legislative powers under the Constitution are vested in a Congress of the United States.What Rayiner is referring to is the inability of the FISA court to create precedent that binds on any other court in the country. The FISC can't overturn any law of Congress or rule it unconstitutional. Moreover, as an instrument of Congress operating outside of Article III, Congress can settle any dispute with FISC by abolishing the court. It cannot do that with other federal courts except in extreme circumstances.", "Is it possible that they're just wrong? Congress also established the bankruptcy court as an inferior federal court, and the bankruptcy court isn't an Article III court. Neither is the court of federal claims, right?If they were right, how could FISA be constitutional? Article III is pretty short and clear.Is it possible that this incredibly confusing situation is deliberate? Of the bizarro federal courts, the FISC is the only one in which regular Article III judges are appointed, which blurs the distinction (also also short-circuits the need for Senate confirmation --- which, again, back to: not an Article III court).Thank you for showing this to me. Here's another:https://www.fas.org/irp/agency/doj/fisa/fisc-032713.pdf", "Help me understand how Congress can create an inferior federal court that isn't subject to the rules of Article III? Doesn't an Article III court require appointment by the President, confirmation by the Senate, lifetime tenure, and power over all cases arising under the Constitution?Thanks for Megahey! Reading now.", "To your later reply: it sure seems like you're right about the notion of specialized Article III courts. And the fact that FISC judges are part-timers drawn from the federal bench somewhat mitigates the tenure concern. But how do you get around the non-Presidential appointment, and the lack of Senate confirmation? FISC can't possibly set a president that a party with a veto-proof majority can create speciality courts to isolate specific controversies appointed by random people without Senate confirmation, can it?", "I didn't think judges qualified as \"inferior officers\", which is a term in the appointments clause with some meaning. Am I wrong? What other judge is appointed as an \"inferior officer\" outside of advise and consent process?See Rehnquist in Edmund v US, in which the standard for \"inferior officer\" is (paraphrased) \"reports to or is directed by a principal officer\", which is something you can't say about an Article III judge.", "Here's what Edmund says, in holding (ironically given my argument) that a military court appeals judge is an inferior officer:Generally speaking, the term \"inferior officer\" connotes a relationship with some higher ranking officer or officers below the President: whether one is an \"inferior\" officer depends on whether he has a superior. It is not enough that other officers may be identified who formally maintain a higher rank, or possess responsibilities of a greater magnitude. If that were the intention, the Constitution might have used the phrase \"lesser officer.\" Rather, in the context of a clause designed to preserve political accountability relative to important government assignments, we think it evident that \"inferior officers\" are officers whose work is directed and supervised at some level by others who were appointed by presidential nomination with the advice and consent of the Senate.The reason Rehnquist gave for seeing military court judges as inferior was that the military reports directly to the Secretary of Defense:Congress used similar language in establishing the Department of War, repeatedly referring to the Secretary of that department as a \"principal officer,\" and the chief clerk, who would be \"employed\" within the Department as the Secretary \"shall deem proper,\" as an \"inferior officer.\" 1 Stat. 49, ch. VII.To whom would a FISC judge report? Article III judges aren't directed by the Supreme Court or (obviously) the Attorney General or even the President.", "Thrilled to have more reading material. Thanks!", "Is this Lawrence Baum, an OSU professor of judicial politics, saying the opposite?http://courtslaw.jotwell.com/judicial-specialization-and-the...", "Sure. An analogous application of secret policy working within the framework of a law that delegates huge amounts of authority to the executive would be military strategy. Another would be FBI investigation priorities.If you remove the \"secret\" constraint, but keep unilateral authority to do rulemaking without line-item approval by Congress, you can come up with zillions of examples.", "Nobody. If you disagree, organize their ouster. Just be warned that by all appearances most Americans don't see this as a voting issue.", "There was massive public outrage over the civil rights cases of the 50's and 60's, too.", "You're having a different discussion than Rayiner is having, which makes this comment a little unhelpful. Your comment would make more sense as its own top-level root comment, rather than as a nonresponsive reply to Rayiner.", "Sure. But your perspective rejects the premises of Rayiner's initial comment, so repeating it more emphatically as you did upthread is problematic.", "A thread from earlier today that went into some diagnostic depth on this point:https://news.ycombinator.com/item?id=6008976", "The circumstances BEAST relies on involves a rapidly diminishing set of browsers. As I understand it, BEAST is less of a motivator for RC4 than Lucky 13.", "Because there's a karma threshold attached to promotion, a user who has some demonstrated engagement with the site will have to make a deliberate decision to grant a forum to limbo comments. That person will have to believe the comment makes a positive contribution and maintains civility.The phenomenon that bolts fatuous vitriol to the tops of threads requires no such deliberation.I have no idea if this is going to work, but I'm psyched to see it play out.", "Here's the thread:https://news.ycombinator.com/item?id=5936055To be clear: what he's saying in this thread seems to support the idea of a karma-limited feature for showing comments. The score (not the content) on a comment would have been negative; the comment, in context, was a superficial negative comment that commanded the top spot on a thread.", "His wording was hyperbolic but his point wasn't far off the mark if you compare the restaurant scene in SF (or NYC or Chicago) to that of South Bay.", "This is a little like talking about the restaurant scene in Yountville. I mean, yeah, but what else is there in Yountville?", "Because here \"client-side bot\" includes bots written in Javascript served up from arbitrary pages on the web.I don't understand your second question, like, at all.", "Oh, sorry. A few years ago, people might have selected RC4 for its speed. These days, people who deliberately enable RC4 are doing it because they're concerned about the Lucky13 attack on TLS CBC. It's a rock/hard-place situation with a pair of TLS vulnerabilities that both require adoption of TLS 1.2 to decisively mitigate.", "Click the sidebar for a link to the full paper. I'm fond of feigning disbelief at how simple this attack is, given how widespread RC4's adoption is. Of the crypto attacks you'll read about, this is among the simplest to understand.    As RC4 encryption is dened as Cr = Pr ^ Zr, the corresponding ciphertext byte Cr \n    has a bias towards plaintext byte Pr. Thus, obtaining sufficiently many ciphertext \n    samples Cr for a fixed plaintext Pr allows inference of Pr by a majority vote: Pr \n    is equal to the value of Cr that occurs most often.\n\n(This attack turns out not to be directly workable, but the working attack isn't much harder.)This is operationally important crypto research; if you understand it, you may configure your servers differently.", "I dispute the first graf for three reasons. First, the attack (you can play with it yourself; it's one of our upcoming crypto challenges) is relative to the start of the art in cryptography devastatingly easy to carry out; it takes a large amount of time, and may not be suitable for mass attacks, but one can imagine circumstances today in which this attack could be workable for targeted high-value secrets. Second, the kinds of advances in this attack that will make it more viable are less likely to be cryptographic and more likely to be systems programming related; as people play with the attack and explore more of the interactions between browsers and (say) specific RC4 bias positions, I think we're likely to find \"non-cryptographic\" (to coin a term) refinements of the attack that will make it scarier. The tempo of these kinds of advances is much, much faster than the tempo of fundamental advances in crypto. Finally, I think that graf doesn't adequately capture the other circumstances in which RC4 is used --- it's not a hair-on-fire operational issue for the web today, but it might be hair-on-fire for less well-understood cryptosystems.", "It's necessary to understand why the attack works, but not so much for understanding how to implement it. But you're right.", "It's easy to come to the conclusion that a big part of what's happening the news media is that lay journalists are each coming to their own idiosyncratic and incompatible conclusions, often from first principles, about how the law operates. \"What I've discerned,\" you imagine them thinking, \"is that SCOTUS first issues rulings defining what words like 'relevant' mean, and then the principle of stare decisis give that definition force going forward.\"Of course that's not at all what happens. To see why, you merely need to look at the different ways the word \"relevant\" are routinely used in law; relevance is germane to hiring decisions, to college admissions, to admissibility of evidence in civil cases, and to the commerce powers of the federal government. Clearly all these concepts aren't regulated by Terry v Ohio!(It is, as Kerr points out, very possible that the courts are relying on Terry in this case. But if they are, what's notable is the application of Terry at all, not a change in the meaning of Terry.)", "I think I get what you're saying; you don't care what the law says, because you believe surveillance on the NSA's scale is wrong. I'm not sure who you think you're arguing with.You indulge the nitty-gritty detail of the topic I'm discussing anyways, in order to dismiss what I said. But your dismissal doesn't make any sense; you appear incapable of comprehending that there's a second order of relevance at play in cases determining what \"relevant\" means to different circumstances. Is the color of someone's hair relevant to predicting their performance on a job? Objection! Requires court to recursively evaluate concept of relevance! Overruled.I don't know who you're referring to when you point to \"self-styled intellectuals\", but if it's a participant on this thread, I'd note that nobody here has taken to calling you names.", "I have absolutely no idea what this comment is supposed to mean. If SCOTUS ruled that any part of FISA was unconstitutional, that ruling would be enforceable. Contrary to the popular misunderstanding of FISA as a shadow court system, FISA enjoys literally zero immunity to judicial review. It's not even a real court.", "So? Most decisions the USG makes aren't adversarial, and yet SCOTUS routinely intervenes in them. Again: the best way to think about FISA is to remember that it's not a real court. It's an internal review board staffed by federal judges who can issue warrants.This point is, I think, frequently misinterpreted. It's not a defense of FISA. FISA is a terrible system and a dereliction of the duties of Congress. But it's not an intractable legal obstacle. The reason that it's difficult to engage FISA in the Supreme Court isn't that FISA is shadowy, but rather that the Constitution doesn't have much to say about foreign intelligence, and there aren't a lot of opportunities for citizens to get their hooks into FISA/NSA in order to get standing in court.That would, of course, change rapidly if the FISA process started being used to make criminal cases in the US.", "I'm not a lawyer; I just play one on message boards. Also, while I think my invocation of \"review boards\" is closer to the truth than the notion that the FISC is a real court, you should know that the sentiment is disputed and though I don't believe it's hyperbolic, some people do.Courts of law established by the federal government must comply with Article III of the US Constitution (state courts, which is where the overwhelming majority of all controversies in the US are heard, don't need to be structured along the lines of Article III, because the US Constitution defines the federal government and not the state governments).An Article III court is staffed with a federal judge appointed by the President (as specified in Article II) with a lifetime tenure. Article III courts \"extend to all cases, in law and equity, arising under this Constitution\".FISC court judges are appointed from the federal bench (they're judges appointed by a President for a lifetime term on a federal court). But they have a limited tenure on FISC --- seven years. And unlike Article III appointments, FISC judges are appointed by the Chief Justice of the Supreme Court. And, most importantly, FISC judges do not have power that extends to all cases in law and equity under the Constitution. In fact, the only thing they're empowered to do is authorizing FISA certifications.Things that the FISC does not appear to be able to do: hear criminal cases, sentence defendants, overturn laws, or establish precedents binding on any other court.There are other federal courts that aren't Article III courts --- bankruptcy is one of them. Bankruptcy court judges have 14 year terms. Even though they function as part of the district court system, the Judiciary is clear that they aren't Article III judges. It's worth noting that Bankruptcy's bizarro status in the court system has also created stare decisis problems with the rest of the court system. There's little reason to believe that FISA courts, which are even further removed from Article III than Bankruptcy, would be more judicially potent.One dispute about the Constitutional status of FISC judges arises from case law in the 1990s, wherein a defendant claimed that the FISC was a violation of separation of powers. The appellate decision ruled that FISC judges weren't violating Article III by serving on the FISC, but I dispute that the language in the decision dictates that those judges are in fact Article III judges; I think it says merely that a federal judge doesn't violate Article III by sitting on a body that is effectively an agent of Congress. If they are Article III courts, the FISC is unconstitutional (in a technical way, not a substantive way).I'm a layperson summarizing independent research here, so I'd very much appreciate an expert's opinion on this analysis.", "The President appoints Court of International Trade judges, and those appointments are confirmed by the Senate.I think you and 'DannyBee have made it pretty clear that relying on the idea that the FISC isn't an Article III court is a perilous position, but I continue to be unclear on how FISC possibly could be an Article III court given its structure.", "No it doesn't. The FISA court is a civilian body, the DNI is a civilian position, and the DNI serves at the pleasure of the civilian President. Not only that, but the FISA process isn't emergent from Article III of the Constitution, but is rather an instrument of Congress which can be reformed entirely by civilian legislative acts by representatives directly elected by the population. There is no truth to the idea that NSA lacks civilian oversight.The point you want to be making is about transparency, and about general citizen oversight. The distinction is extremely important; for instance, random citizens of the US have no direct oversight over military operations, never have, and never will. If you make the argument about civilian oversight, you've already lost, because the intelligence system does in fact have civilian oversight; it's just not the oversight you want.", "I have no faith in the FISA court, but I have a different diagnosis than you do about why the process isn't trustworthy, and my prescription for solving the problem doesn't have anything to do with strengthening the FISC.", "Huh? You don't feel like you know enough to vote against your representatives today, or to discern whether you should vote for their opponents? Do they support PATRIOT? Do they support FISA as it stands? If yes to either, vote no.Again the problem isn't oversight, but rather (in this instance) that you realize that most of the population doesn't agree with you, and won't vote a representative out of office solely because of their position on FISA.", "No, he doesn't have to make that argument, because Congress deliberately passed rulemaking authority to NSA with the FISA court as a limited check, acting as an agent of Congress.Congress has the authority to do that, just like Congress doesn't have to pass individual acts determining each line item NOAA spends money on, or how exactly EPA will monitor industrial emissions.I'm not saying Congress was smart to concede this authority to NSA and FISA; in fact, I think doing so was a dereliction of their duty. But what it wasn't was a power grab by the surveillance state. Rather, it was Congress being too short-sighted and bored of surveillance issue to properly regulate it.", "I understand this point approximately well enough to determine that it's not relevant to any of my points. The FISA process operates under legislative authorization. The congressional motivation to create this dumb process is less relevant to me than what the process actually is. You say FISA is a power grab by NSA; I say FISA is an abrogation of congressional authority to regulate foreign surveillance. Both conclusions lead to the same place, so why bother arguing about it?", "We're in the same camp.", "Exactly so. The right way to think about these \"secret laws\" is that they aren't laws at all. Take the most pessimistic interpretation you can come up with, as long as you stay within the framework of \"this is what Congress authorized NSA to do\". FISA : Article III Courts :: USDA Inspection : Certified Organic.", "I think it's a structurally similar but substantively different problem that resulted in FISA.It's not that foreign signals intelligence is too technical a topic to regulate, but rather that FISA necessarily deals in the whole sweep of the most sensitive secrets the USG handles. One imagines that virtually any sensible bright-line rule a legislature could come up with would immediately compromise some prima facie legitimate objective that NSA might already have. Worse still, the process of sorting out these conflicts between pragmatism and principle involves a sort of survey of the whole landscape of secrecy --- which, suffice it to say, is not a terrain Congress is comfortable wandering around.That's not to say that all, or even most, of what NSA does is prima facie legitimate! It's just to point out that there are probably a diversity of legitimate programs that need to be accounted for, but somehow accounted for without betraying them to the world.", "EXACTLY (i think!). And the answer to your follow-up question appears to be \"no\". It's an open question what the next step should be to augment (or replace) FISA. The system we have now countenanced NSA's requisitioning of Verizon's entire domestic call database under the \"business records\" extension in PATRIOT.", "The US government will say that Snowden's actions harmed the US, and because the harm pertains to national security, America's enemies will be part of the discussion.What's missing from this point is intent. If the USG believed that Snowden had set out to aid America's enemies, he'd have been charged with treason.", "They've charged him with offenses sufficient to incarcerate him for life. If their plan was a bait and switch, they'd have charged him with a parking violation.This thought also ignores the fact that the USG does not in fact wield the charge of treason casually. John Walker Lindh, for instance, wasn't charged with treason, despite being charged with deliberately planning and conspiring to murder American troops.", "What senior USG official called for Snowden to be charged with treason? Remember, in our system of government, individual congresscritters aren't officials; they have extremely limited authority to do anything but contribute to the lawmaking process.Remember, many of the noisest and most obnoxious people in Congress were elected by mere thousands of voters from American backwaters.", "Boehner was elected with something like 200,000 votes from Cincinattans. He can say the word \"treason\" until he's blue in the face, but on the question of what Snowden will be charged with, his words carry no more force than those of a Redstate.com blogger.The numbers scale up a bit for Feinstein, who at least holds statewide office, but the end result is no different.This isn't a fiddly technical point. The separation of powers between the Legislative and Executive branches is fundamental to our system of government. In cases where dingbat representatives try to rabble-rouse for unwarranted treason charges, you can see why the founders were smart to divest the Legislature of the power to enforce the laws they enact.", "It's hard to rule out any possibility. Such is the nature of ruling things out.", "The USG could tomorrow transform itself into a despotism dedicated to the proposition that all men should wear loincloths made of cheese curds. You can't falsify that argument either.I'm not making a substantive argument about Snowden's charges, except to point out that the notion of \"aiding America's enemies\" has force only when coupled with intent. Treason isn't a strict liability crime.", "This is a point Orin Kerr addressed directly a few days ago, in a piece analyzing Lichtblau's NYT FISA bombshell (NYT bombshell story: bolted to top of front page for 2 days; Orin Kerr's careful dissection of same: 3 upvotes).Specifically: the notion of \"relevance\" we seem to be working from comes from Terry, which is confusing, because Terry determines when the police can briefly detain people and frisk them to ensure the safety of the police officers. Terry isn't (at least as I understand it) doctrinally fundamental in any way.", "Enemy combatants do not have habeas corpus rights and never have. When Allied forces captured German soldiers in World War II, they were not required to present them to a judge and those soldiers weren't sentenced; they were held until the conflict ended. If Allied forces accidentally rounded up German civilians in the process, those civilians could also expect indefinite detention.In a world historical sense, such treatment is a mercy; in total war, the only alternative, of course, is to kill the detainees.GTMO represents a great moral failing of the United States, but let's also not forget that the USG is the lesser of two culpable parties; the greater responsibility lies with an irregular army that deliberately exploits its civilian host population to conceal itself, relying on the fact that retaliation will inevitably harm more innocents than fighters. The Taliban isn't the Viet Cong. The cause of the Taliban and \"Al Qaeda\" (whatever that means) is a lost one, fueled entirely by an obscene willingness to see thousands of innocent people murdered solely prolong the inevitable.", "1. Many of them were in fact armed combatants. A significant problem in securing the release of GTMO detainees is that they were handled so clumsily that it was difficult to sort out which detainees were victims of circumstance and which were violent. Several people released from GTMO have later been killed or captured in armed conflict with NATO forces.2. By \"allied\" he meant \"NATO\". There are plenty of \"black\" people in NATO.3. Afghanistan was in fact a war zone long before 2001. At its most orderly, under the brutal control of the Taliban, it was a loosely organized state embroiled in a civil war destined to produce a breakaway non-Pashto state. Also: the word \"disappeared\" means something specific, and you dilute that meaning by using it here. The \"disappeared\" of Central and South America are so named because they're never heard from again; they're often murdered by death squads.4. Nothing in the Geneva Conventions speaks to the definition of \"kidnapping\".", "Since we've apparently reached \"QED\", there's little point in continuing the discussion.", "This glib sentiment ignores the reality that there are in fact thousands of armed militants in Afghanistan who will happily kill tens of innocent Afghanis on spec just for the prospect of killing a single NATO soldier, and that the vast majority of those militants have not been captured.One needn't support GTMO, or even tolerate it, to acknowledge the fact that our adversaries in this conflict are both real and despicable.", "Neither Russia nor the US forced militants to establish a despotic theocracy in Afghanistan dedicated to the facially ridiculous prospect of establishing an Islamic Caliphate that would run the middle east under medieval religious law, or to host a transnational irregular armed force dedicated to the delusional prospect of hastening that lost cause by targeting and murdering civilians abroad.If you want to pursue a line of argument that leaves you sticking up for the Taliban, that's your prerogative, but I don't think doing so will strengthen any case you have to make about the US.", "The fact that the Taliban was a despicable force for evil doesn't moot the idea that politicians and demagogues in the US and Europe have exploited Islamaphobia, nor does it imply that the Taliban or Al Qaeda is a threat worthy of the degree of state machinery we've allocated to it.None of these things are black and white.", "It seems pretty clear that torture did happen at/around GTMO, and that it ceased (modulo force feeding) under Obama.", "Neither characterization is true. GTMO detainees weren't kidnapped, but there's little evidence to suggest that most of them were actual combatants.It upsets me a little to see discussions about things like GTMO distracting themselves from the core issue. The problem isn't detention at GTMO, or drone strikes, or the citizenship status of targets. To engage yourself fully with any of those problems is to nibble around the edges of the real issue.The problem is that in 2001, Congress issued a declaration of war (that's what the AUMF was) against an ideology. At the time, that might have seemed sensible; a way to take the threat of armed terrorism more seriously than we had. But the problem with it is obvious and it's something Obama is facing down now: you can't eradicate an ideology, which leaves us in a permanent state of war.If we'd declared war against Afghanistan, the status of prisoners at GTMO would be clearer; we'd at some point declare the conflict over (we'd have to, because contra the Daily Kos left, the USG does not actually want to station hundreds of thousands of soldiers in Afghanistan) and the prisoners would be released.", "\"Those nations, organizations, or persons [...] planned, authorized, committed, or aided the terrorist attacks [...] or harbored such organizations or persons\" describes an ideology.The problematic word is \"organizations\". The most important lesson we should learn from the 2000s is \"never allow the word 'organizations' (or any of its synonyms) to appear in an AUMF again\". You can invade a nation, you can kill a person, but there's simply no clear definition of what it means to eradicate an organization.", "The core problem I see this consultant facing is that they're doing business with an individual person and not with a business. Take people out to dinner. But do business with their companies.", "The key difference between working for an annoying employee of a company and working for an annoying person is that the annoying employee isn't spending their own money. Both the spend and the return on spending are (usually) abstractions to employees. They're all too vivid to sole proprietors.", "No, it's 20k/yr. When you run a consulting business, you value clients by the revenue they'll generate every year. Obviously, you have lots of clients.", "I think you're overthinking.To us, a 20k/yr client is someone we can forecast 20k worth of work with. You can forecast work from any client that does multiple projects with you.But it's also worrisome that you see a formalized 20k/yr client as an oddity, because that arrangement is basically a retainer, and consultants should know how to structure retainers.", "Nobody said anything about delivery constraints. 20k/yr is a sales figure.", "You're getting a little bit of tunnel vision over deal structure here, which has nothing to do with the point the article is making.", "You should think twice before applying to YC with a social network for cats or cars if only because if you do that you're unlikely to get accepted.", "CAs are a single point of failure if a government can get a key that your counterpart's UI will claim belongs to you.", "The argument in favor of S/MIME is that it's already there and just works.", "That's because W3C's goal in having a cryptography standard isn't security, but rather interoperability; they see encryption as another step towards making the web a first-class application development environment. Without it, they can't get Netflix to run on pure \"open\" web technology.It's unfortunate, because we could use a secure browser crypto interface much more than we could use better browser interoperability with random non-web technology. But our industry is, of course, fundamentally unserious about security.", "Sure you can. Our democratic process involves people choosing a credible representative, who then hires a staff and meets with other representatives in order to make decisions. An activist working within the system can, as I feel like you've pointed out before, ignore public opinion and lobby representatives directly; \"lobby\" is a curse word around here, but obviously it's not always a bad thing.", "My prediction is that the kernel of the idea that will make GPG usable is to dispense with the idea of a single keypair, and instead build features that generate ephemeral keypairs on the fly. Make the system workable for users even if they don't understand what a keypair is. Some of what makes OTR effective can be implemented using PGP as the underlying cryptosystem.When one suggests replacing OTR, one tends to get an earful about the importance of forward secrecy. I think forward secrecy is very important for systems in which there are extremely high-value keys that are \"stationary targets\". I think forward secrecy is less valuable in desktop applications, where the attacks that would cough up a persistent key would tend to be devastating to the whole cryptosystem anyways.It's also worth saying that PGP isn't a particularly great cryptosystem. \"Modern\" PGP predates a lot of important stuff in crypto. But it's a very well studied cryptosystem.There are strong cryptographers who are working on much, much better systems than PGP. The problem is that those systems will compete with amateur systems and the winner won't be chosen by security. At least with PGP, we know what we're getting.", "I would if I could, but another distinction between real cryptographers and amateur ones is a desire not to publicize things until the design is trustworthy. I think you'll have to take my word for this (but I'll try to think of one I can share).", "What does this mean? We just got finished talking about a system that was profoundly less secure because it tried too hard to be easy to use.", "It still requires users to understand that they have a public and a private key, and just one of them, and a \"key ring\" to which they add their counterparties public keys, and that those keys themselves have to be authenticated and \"signed\" if the system is to be secure.", "You can do all that stuff, but it's the fact that you have to understand these concepts to use PGP that makes it difficult, not the way they're documented.", "Cryptocat is an attempt to solve the accessibility problem that essentially handwaves away many key problems in cryptographic security. It's a system that is simple for users to use because it's simplistic, and is thus less secure even than some other very-simple systems.For instance, OTR (as implemented by IM clients) is an example of an extraordinarily simple cryptosystem (I'd argue too simple) that at least provides for a notion of persistent keys.", "The idea that Wikileaks would be represented by a holocaust-denying quasi-apparatchik is so DC-comics evil that even I doubt it's real.You'd like a clearer denial from Wikileaks about it, but then, you'd like a clearer denial about anything in any dispute, and it's not always reasonable to demand one: at some point things devolve to \"half you stopped beating your wife yet?\" Advocating the for the government of Belarus is, in geopolitical terms, really epsilon from beating ones spouse.", "This is a scary comment; it reifies the abstract concern Rayiner had upthread. Favorable post-Democracy though technology? That sounds like something Aldous Huxley would write about.", "It's possible to look at the antagonists of most dystopian fiction and find the noble intentions.Rayiner's point wasn't that technology intrinsically subverts the social contract; only that some technologists seem to want it to.", "I agree about our prospects. Have a good rest of your weekend.", "I'm thankful that we don't have that feature. After a day or two, any argument you get into on HN is likely to die because no feature of the site jams replies to old comments in your face.", "That 'pg decided the feature you're looking for is more trouble than its worth.", "I wouldn't exactly call FAIR \"independent\". OTM is an NPR show; I suppose it's dependent on NPR member stations or something. FAIR is ideologically dependent on the progressive left. If I have to choose dependencies, I'll go with NPR middle-of-the-roadness.Thankfully, I don't have to choose, and so can enjoy FAIR's podcast while augmenting it with other sources. Thanks for sharing that; I had no idea they had a podcast.", "I don't disagree, but you see how fuzzy a concept \"mainstream\" is, right? CNN is owned by a massive media conglomerate. NPR isn't. In that sense, NPR is independent. Meanwhile, there's plenty of outsider content to be found under corporate umbrellas, too. The Koch brothers, for instance, fund Cato.", "It means that they cater to a specific audience with a specific ideology and are less likely to present analysis that challenges that ideology.(For what it's worth: that ideology is also my ideology).", "You should listen to OTM more. It's media criticism, so what reporting it does will necessarily seem like navel-gazing. But  there's been some really great stuff on it.A less... lubricated... venue for this kind of analysis is Jack Schafer's work for Reuters. Schafer has none of the insider status that OTM does."]}
